Revit 2022 API
BuiltInFailures.DisplacementElementFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.DisplacementElementFailures type exposes the following members.
Properties
Name | Description
CannotCopyDisplacementSetIntoOtherDocument
 A Displacement Set can only be pasted into a view in the same document in which it was created.
CannotRemoveLastDisplacedElement
 A Displacement Set can only be pasted into a view in the same document in which it was created.
DetectedCycleInDisplacedElementParents
 Invalid parent relationship for a Displacement element. No cycles are allowed.
ElementsAlreadyDisplacedInView
 A Displacement Set can only be pasted into a 3D view in which none of its sub-elements is already a sub-element of another Displacement Set.
See Also
BuiltInFailures.DisplacementElementFailures Class
Autodesk.Revit.DB Namespace